cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
<?xml version="1.0" encoding="utf-8"?> 

<device schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="CMSIS-SVD_Schema_1_1.xsd">
	<name>NeoM3</name>
	<version>0.7</version>
	<description>Neo M3</description>
	<cpu>
		<name>CM3</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>0</mpuPresent>
		<fpuPresent>0</fpuPresent>
		<nvicPrioBits>3</nvicPrioBits>
		<vendorSystickConfig>0</vendorSystickConfig>
	</cpu>
	
	<headerDefinitionsPrefix>LPC_</headerDefinitionsPrefix> 
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<size>32</size>

	<!--
		Software that is described herein is for illustrative purposes only
		which provides customers with programming information regarding the
		products. This software is supplied "AS IS" without any warranties.
		NXP Semiconductors assumes no responsibility or liability for the
		use of the software, conveys no license or title under any patent,
		copyright, or mask work right to the product. NXP Semiconductors
		reserves the right to make changes in the software without
		notification. NXP Semiconductors also make no representation or
		warranty that such application will be suitable for the specified
		use without further testing or modification.	
		
	-->	





	

	<peripherals>
		<peripheral>
	<name>FLASHCTRL</name>
	<description>Flash control block</description>
	<groupName>FLASHCTRL</groupName>
	<baseAddress>0x00200000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>EEPROM</name>
	<value>40</value>
	</interrupt>
	<registers>
											
			<register>									
				<name>FMSSTART</name>								
				<description>Signature start address register</description>								
				<addressOffset>0x020</addressOffset>								
				<access>read-write</access>								
				<resetValue>0</resetValue>								
				<resetMask>0xFFFFFFFF</resetMask>								
				<fields>								
					<field>							
						<name>START</name>						
						<description>Signature generation start address (corresponds to AHB byte address bits[20:4]).</description>						
						<bitRange>[16:0]</bitRange>						
					</field>							
					<field>							
						<name>RESERVED</name>						
						<description>Reserved. Read value is undefined, only zero should be written.</description>						
						<bitRange>[31:17]</bitRange>						
					</field>							
				</fields>								
			</register>									
			<register>									
				<name>FMSSTOP</name>								
				<description>Signature stop-address register</description>								
				<addressOffset>0x024</addressOffset>								
				<access>read-write</access>								
				<resetValue>0</resetValue>								
				<resetMask>0xFFFFFFFF</resetMask>								
				<fields>								
					<field>							
						<name>STOP</name>						
						<description>BIST stop address divided by 16 (corresponds to AHB byte address [20:4]).</description>						
						<bitRange>[16:0]</bitRange>						
										
					</field>							
					<field>							
						<name>SIG_START</name>						
						<description>Start control bit for signature generation.</description>						
						<bitRange>[17:17]</bitRange>						
						<enumeratedValues>						
							<name>ENUM</name>						
							<enumeratedValue>					
								<name>STOP</name>				
								<description>Signature generation is stopped</description>				
								<value>0</value>				
							</enumeratedValue>					
							<enumeratedValue>					
								<name>START</name>				
								<description>Initiate signature generation</description>				
								<value>1</value>				
							</enumeratedValue>					
						</enumeratedValues>						
					</field>							
					<field>							
						<name>RESERVED</name>						
						<description>Reserved. Read value is undefined, only zero should be written.</description>						
						<bitRange>[31:18]</bitRange>						
											
					</field>							
				</fields>								
			</register>									
			<register>									
				<name>FMSW0</name>								
				<description>128-bit signature Word 0</description>								
				<addressOffset>0x02C</addressOffset>								
				<access>read-only</access>								
				<resetValue>0</resetValue>								
				<resetMask>0x00000000</resetMask>								
				<fields>								
					<field>							
						<name>SW0_31_0</name>						
						<description>Word 0 of 128-bit signature (bits 31 to 0).</description>						
						<bitRange>[31:0]</bitRange>						
					</field>							
				</fields>								
			</register>									
			<register>									
				<name>FMSW1</name>								
				<description>128-bit signature Word 1</description>								
				<addressOffset>0x030</addressOffset>								
				<access>read-only</access>								
				<resetValue>0</resetValue>								
				<resetMask>0x00000000</resetMask>								
				<fields>								
					<field>							
						<name>SW1_63_32</name>						
						<description>Word 1 of 128-bit signature (bits 63 to 32).</description>						
						<bitRange>[31:0]</bitRange>						
					</field>							
				</fields>								
			</register>									
			<register>									
				<name>FMSW2</name>								
				<description>128-bit signature Word 2</description>								
				<addressOffset>0x034</addressOffset>								
				<access>read-only</access>								
				<resetValue>0</resetValue>								
				<resetMask>0x00000000</resetMask>								
				<fields>								
					<field>							
						<name>SW2_95_64</name>						
						<description>Word 2 of 128-bit signature (bits 95 to 64).</description>						
						<bitRange>[31:0]</bitRange>						
					</field>							
				</fields>								
			</register>									
			<register>									
				<name>FMSW3</name>								
				<description>128-bit signature Word 3</description>								
				<addressOffset>0x038</addressOffset>								
				<access>read-only</access>								
				<resetValue>0</resetValue>								
				<resetMask>0x00000000</resetMask>								
				<fields>								
					<field>							
						<name>SW3_127_96</name>						
						<description>Word 3 of 128-bit signature (bits 127 to 96).</description>						
						<bitRange>[31:0]</bitRange>						
					</field>							
				</fields>								
			</register>									
												
												
												
		
		<register>
			<name>EECMD</name>
			<description>EEPROM command register</description>
			<addressOffset>0x080</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CMD</name>
					<description>Command. 000: 8-bit read 001: 16-bit read 010: 32-bit read 011: 8-bit write 100: 16-bit write 101: 32-bit write 110: erase/program page 111: reserved</description>
					<bitRange>[2:0]</bitRange>
				</field>
				<field>
					<name>RDPREFETCH</name>
					<description>Read data prefetch bit. 0: do not prefetch next read data as result of reading from the read data register. 1: prefetch read data as result of reading from the read data register. When this bit is set multiple consecutive data elements can be read without the need of programming new address values in the address register. The address post-increment and the automatic read data prefetch (if enabled) allow only reading from the read data register to be done to read the data.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEWDATA</name>
			<description>EEPROM write data register</description>
			<addressOffset>0x088</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>WDATA</name>
					<description>Write data. In case of: 8-bit write operations: bits [7:0] must contain valid write data. 16-bit write operations: bits [15:0] must contain valid write data. 32-bit write operations: bits [31:0] must contain valid write data.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EERDATA</name>
			<description>EEPROM read data register</description>
			<addressOffset>0x08C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RDATA</name>
					<description>Read data. In case of: 8-bit read operations: bits [7:0] contain read data, others are zero. 16-bit read operations: bits [15:0] contain read data, others are zero. 32-bit read operations: bits [31:0] contain read data.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEWSTATE</name>
			<description>EEPROM wait state register</description>
			<addressOffset>0x090</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PHASE3</name>
					<description>Wait states 3 (minus 1 encoded). The number of system clock periods required to give a minimum time of 15 ns.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>PHASE2</name>
					<description>Wait states 2 (minus 1 encoded). The number of system clock periods required to give a minimum time of 55 ns.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>PHASE1</name>
					<description>Wait states 1 (minus 1 encoded). The number of system clock periods required to give a minimum time of 35 ns.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EECLKDIV</name>
			<description>EEPROM clock divider register</description>
			<addressOffset>0x094</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKDIV</name>
					<description>Division factor (minus 1 encoded).</description>
					<bitRange>[15:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EEPWRDWN</name>
			<description>EEPROM power-down register</description>
			<addressOffset>0x098</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PWRDWN</name>
					<description>Power down mode bit. 0: not in power down mode. 1: power down mode (this will put all EEPROM devices in power down).</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:1]</bitRange>
				</field>
			</fields>
		</register>
		<register>									
			<name>STAT</name>								
			<description>Signature generation status register</description>								
			<addressOffset>0xFE0</addressOffset>								
			<access>read-only</access>								
			<resetValue>0</resetValue>								
			<resetMask>0xFFFFFFFF</resetMask>								
			<fields>
				

				<field>							
					<name>RESERVED</name>						
					<description>Reserved. The value read from a reserved bit is not defined.</description>						
					<bitRange>[1:0]</bitRange>						
				</field>							
				<field>							
					<name>SIG_DONE</name>						
					<description>When 1, a previously started signature generation has completed. See FMSTATCLR register description for clearing this flag.</description>						
					<bitRange>[2:2]</bitRange>						
				</field>
				<field>							
					<name>RESERVED</name>						
					<description>Reserved. The value read from a reserved bit is not defined.</description>						
					<bitRange>[25:3]</bitRange>						
				</field>					
				<field>
					<name>END_OF_RDWR</name>
					<description>EEPROM read/write operation finished interrupt status bit. Bit is: - set when this operation has finished OR when 1 is written in the corresponding bit of the EEINTSTATSET register. - cleared when 1 is written to the corresponding bit of the EEINTSTATCLR register.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>END_OF_PROG1</name>
					<description>EEPROM program operation finished interrupt status bit. Bit is: - set when this operation has finished OR when 1 is written to the corresponding bit of the EEINTSTATSET register. - cleared when 1 is written to the corresponding bit of the EEINTSTATCLR register.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:29]</bitRange>
				</field>				
						
			</fields>								
		</register>
		<register>
			<name>INTEN</name>
			<description>EEPROM interrupt enable</description>
			<addressOffset>0xFE4</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>EE_RW_DONE</name>
					<description>EEPROM read/write operation finished interrupt enable bit. Bit is: - set when 1 is written to the corresponding bit of the EEINTENSET register. - cleared when 1 is written to the corresponding bit of the EEINTENCLR register.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EE_PROG_DONE</name>
					<description>EEPROM program operation finished interrupt enable bit. Bit is: - set when 1 is written in the corresponding bit of the EEINTENSET register. - cleared when 1 is written to the corresponding bit of the EEINTENCLR register.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
		<register>									
			<name>STATCLR</name>								
			<description>Signature generation status clear register</description>								
			<addressOffset>0xFE8</addressOffset>								
			<access>write-only</access>								
			<resetValue>0</resetValue>								
			<resetMask>0x00000000</resetMask>								
			<fields>								
				<field>							
					<name>RESERVED</name>						
					<description>Reserved. Read value is undefined, only zero should be written.</description>						
					<bitRange>[1:0]</bitRange>						
				</field>							
				<field>							
					<name>SIG_DONE_CLR</name>						
					<description>Writing a 1 to this bits clears the signature generation completion flag (SIG_DONE) in the FMSTAT register.</description>						
					<bitRange>[2:2]</bitRange>						
				</field>							
			
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[25:3]</bitRange>
				</field>
				<field>
					<name>RDWR_CLR_ST</name>
					<description>Clear read/write operation finished interrupt status bit (EEPROM). 0 leave corresponding bit unchanged. 1 clear corresponding bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PROG1_CLR_ST</name>
					<description>Clear program operation finished interrupt status bit for EEPROM device 1. 0 leave corresponding bit unchanged. 1 clear corresponding bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>								
		</register>
		<register>
			<name>ENCLR</name>
			<description>EEPROM interrupt enable clear</description>
			<addressOffset>0xFD8</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RDWR_CLR_EN</name>
					<description>Clear read/write operation finished interrupt enable bit (EEPROM). 0: leave corresponding bit unchanged. 1: clear corresponding bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PROG1_CLR_EN</name>
					<description>Clear program operation finished interrupt enable bit for EEPROM device 1. 0: leave corresponding bit unchanged. 1: clear corresponding bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>ENSET</name>
			<description>EEPROM interrupt enable set</description>
			<addressOffset>0xFDC</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RDWR_SET_EN</name>
					<description>Set read/write operation finished interrupt enable bit (EEPROM). 0: leave corresponding bit unchanged. 1: set corresponding bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PROG1_SET_EN</name>
					<description>Set program operation finished interrupt enable bit for EEPROM device 1. 0: leave corresponding bit unchanged. 1: set corresponding bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
		
		
		
		
