cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
		<register>
			<name>DEVINTSET</name>
			<description>USB Device Interrupt Set</description>
			<addressOffset>0x20C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>FRAMESET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EP_FASTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EP_SLOWSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DEV_STATSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>CCEMPTYSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>CDFULLSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RxENDPKTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>TxENDPKTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EP_RLZEDSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERR_INTSET</name>
					<description>0 = No effect. 1 = The corresponding bit in USBDevIntSt (Section 13.10.3.2) is set.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CMDCODE</name>
			<description>USB Command Code</description>
			<addressOffset>0x210</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:0]</bitRange>
					
				</field>
				<field>
					<name>CMD_PHASE</name>
					<description>The command phase:</description>
					<bitRange>[15:8]</bitRange>
					<enumeratedValues>
						<name>ENUM</name>
						<enumeratedValue>
							<name>READ</name>
							<description>Read</description>
							<value>0x02</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITE</name>
							<description>Write</description>
							<value>0x01</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>COMMAND</name>
							<description>Command</description>
							<value>0x05</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>CMD_CODE_WDATA</name>
					<description>This is a multi-purpose field. When CMD_PHASE is Command or Read, this field contains the code for the command (CMD_CODE). When CMD_PHASE is Write, this field contains the command write data (CMD_WDATA).</description>
					<bitRange>[23:16]</bitRange>
					
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:24]</bitRange>
					
				</field>
			</fields>
		</register>
		<register>
			<name>CMDDATA</name>
			<description>USB Command Data</description>
			<addressOffset>0x214</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CMD_RDATA</name>
					<description>Command Read Data.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:8]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXDATA</name>
			<description>USB Receive Data</description>
			<addressOffset>0x218</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RX_DATA</name>
					<description>Data received.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>TXDATA</name>
			<description>USB Transmit Data</description>
			<addressOffset>0x21C</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>TX_DATA</name>
					<description>Transmit Data.</description>
					<bitRange>[31:0]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RXPLEN</name>
			<description>USB Receive Packet Length</description>
			<addressOffset>220</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PKT_LNGTH</name>
					<description>The remaining number of bytes to be read from the currently selected endpoint's buffer. When this field decrements to 0, the RxENDPKT bit will be set in USBDevIntSt.</description>
					<bitRange>[9:0]</bitRange>
					
