cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
		<register>
			<name>EPINTEN</name>
			<description>USB Endpoint Interrupt Enable</description>
			<addressOffset>0x234</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPEN0</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPEN1</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPEN2</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPEN3</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPEN4</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPEN5</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPEN6</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPEN7</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPEN8</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPEN9</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPEN10</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPEN11</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPEN12</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPEN13</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPEN14</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPEN15</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPEN16</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPEN17</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPEN18</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPEN19</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPEN20</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPEN21</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPEN22</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPEN23</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPEN24</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPEN25</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPEN26</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPEN27</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPEN28</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPEN29</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPEN30</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPEN31</name>
					<description>0= The corresponding bit in USBDMARSt is set when an interrupt occurs for this endpoint. 1 = The corresponding bit in USBEpIntSt is set when an interrupt occurs for this endpoint. Implies Slave mode for this endpoint.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EPINTCLR</name>
			<description>USB Endpoint Interrupt Clear</description>
			<addressOffset>0x238</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>EPCLR0</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>EPCLR1</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>EPCLR2</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>EPCLR3</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>EPCLR4</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>EPCLR5</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>EPCLR6</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>EPCLR7</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>EPCLR8</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>EPCLR9</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>EPCLR10</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>EPCLR11</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>EPCLR12</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>EPCLR13</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>EPCLR14</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>EPCLR15</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>EPCLR16</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>EPCLR17</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>EPCLR18</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>EPCLR19</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>EPCLR20</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>EPCLR21</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>EPCLR22</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>EPCLR23</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>EPCLR24</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>EPCLR25</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>EPCLR26</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>EPCLR27</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>EPCLR28</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>EPCLR29</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>EPCLR30</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>EPCLR31</name>
					<description>0 = No effect. 1 = Clears the corresponding bit in USBEpIntSt, by executing the SIE Select Endpoint/Clear Interrupt command for this endpoint.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
