cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
						</field>
					</fields>
				</register>
				<register>
					<name>SEED</name>
					<description>CRC seed register</description>
					<addressOffset>0x004</addressOffset>
					<access>read-write</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SEED</name>
							<description>A write access to this register will load CRC seed value to CRC_SUM register with selected bit order and 1's complement pre-processes. A write access to this register will overrule the CRC calculation in progresses.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>SUM</name>
					<description>CRC checksum register</description>
					<addressOffset>0x008</addressOffset>
					<access>read-only</access>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CRC_SUM</name>
							<description>The most recent CRC sum can be read through this register with selected bit order and 1's complement post-processes.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
				<register>
					<name>DATA</name>
					<description>CRC data register</description>
					<addressOffset>0x008</addressOffset>
					<access>write-only</access>
					<resetValue>0</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CRC_WR_DATA</name>
							<description>Data written to this register will be taken to perform CRC calculation with selected bit order and 1's complement pre-process. Any write size 8, 16 or 32-bit are allowed and accept back-to-back transactions.</description>
							<bitRange>[31:0]</bitRange>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
	
	

		
		<peripheral>
	<name>GPIO</name>
	<description>General Purpose I/O </description>
	<groupName>GPIO</groupName>
	<baseAddress>0x20098000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<registers>
		<register>
			<dim>6</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-5</dimIndex>
			<name>DIR%s</name>
			<description>GPIO Port0 Direction control register.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PINDIR0</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>PINDIR1</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>PINDIR2</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>PINDIR3</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>PINDIR4</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>PINDIR5</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>PINDIR6</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>PINDIR7</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>PINDIR8</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>PINDIR9</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>PINDIR10</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>PINDIR11</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>PINDIR12</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>PINDIR13</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>PINDIR14</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>PINDIR15</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>PINDIR16</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>PINDIR17</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>PINDIR18</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>PINDIR19</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>PINDIR20</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>PINDIR21</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>PINDIR22</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>PINDIR23</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>PINDIR24</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>PINDIR25</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>PINDIR26</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>PINDIR27</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>PINDIR28</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>PINDIR29</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>PINDIR30</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>PINDIR31</name>
					<description>Fast GPIO Direction PORTx control bits. Bit 0 in DIRx controls pin Px[0], bit 31 in DIRx controls pin Px[31]. 0 = Controlled pin is input. 1 = Controlled pin is output.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
