cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
				</field>
				<field>
					<name>PM</name>
					<description>Page mode. In page mode the EMC can burst up to four external accesses. Therefore devices with asynchronous page mode burst four or higher devices are supported. Asynchronous page mode burst two devices are not supported and must be accessed normally.</description>
					<bitRange>[3:3]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>DISABLED_POR_RESET_</name>
							<description>Disabled (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ASYNCHRONOUS_PAGE_MO</name>
							<description>Asynchronous page mode enabled (page length four).</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[5:4]</bitRange>

				</field>
				<field>
					<name>PC</name>
					<description>Chip select polarity. The value of the chip select polarity on power-on reset is 0.</description>
					<bitRange>[6:6]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>ACTIVE_LOW_CHIP_SELE</name>
							<description>Active LOW chip select.</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>ACTIVE_HIGH_CHIP_SEL</name>
							<description>Active HIGH chip select.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>PB</name>
					<description>Byte lane state. The byte lane state bit, PB, enables different types of memory to be connected. For byte-wide static memories the BLS3:0 signal from the EMC is usually connected to WE (write enable). In this case for reads all the BLS3:0 bits must be HIGH. This means that the byte lane state (PB) bit must be LOW. 16 bit wide static memory devices usually have the BLS3:0 signals connected to the UBn and LBn (upper byte and lower byte) signals in the static memory. In this case a write to a particular byte must assert the appropriate UBn or LBn signal LOW. For reads, all the UB and LB signals must be asserted LOW so that the bus is driven. In this case the byte lane state (PB) bit must be HIGH.</description>
					<bitRange>[7:7]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BLSHIGH</name>
							<description>For reads all the bits in BLS3:0 are HIGH. For writes the respective active bits in BLS3:0 are LOW (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BLSLOW</name>
							<description>For reads the respective active bits in BLS3:0 are LOW. For writes the respective active bits in BLS3:0 are LOW.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EW</name>
					<description>Extended wait (EW) uses the EMCStaticExtendedWait register to time both the read and write transfers rather than the EMCStaticWaitRd and EMCStaticWaitWr registers. This enables much longer transactions. [1]</description>
					<bitRange>[8:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>EXTENDED_WAIT_DISABL</name>
							<description>Extended wait disabled (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>EXTENDED_WAIT_ENABLE</name>
							<description>Extended wait enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[18:9]</bitRange>

				</field>
				<field>
					<name>B</name>
					<description>Buffer enable [2]</description>
					<bitRange>[19:19]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BUFFER_DISABLED_POR</name>
							<description>Buffer disabled (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>BUFFER_ENABLED_</name>
							<description>Buffer enabled.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>P</name>
					<description>Write protect</description>
					<bitRange>[20:20]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>WRITES_NOT_PROTECTED</name>
							<description>Writes not protected (POR reset value).</description>
							<value>0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>WRITE_PROTECTED_</name>
							<description>Write protected.</description>
							<value>1</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:21]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICWAITWEN%s</name>
			
			<description>Delay from EMC_CS0 to write enable.</description>
			<addressOffset>0x204</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAITWEN</name>
					<description>Wait write enable. Delay from chip select assertion to write enable. 0x0 = One CCLK cycle delay between assertion of chip select and write enable (POR reset value). 0x1 - 0xF = (n + 1) CCLK cycle delay. The delay is (WAITWEN +1) x tCCLK.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICWAITOEN%s</name>
			
			<description>Delay from EMC_CS0 or address change, whichever is later, to output enable.</description>
			<addressOffset>0x208</addressOffset>
			<access>read-write</access>
			<resetValue>0x0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAITOEN</name>
					<description>Wait output enable. Delay from chip select assertion to output enable. 0x0 = No delay (POR reset value). 0x1 - 0xF = n cycle delay. The delay is WAITOEN x tCCLK.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICWAITRD%s</name>
			
			<description>Delay from EMC_CS0 to a read access.</description>
			<addressOffset>0x20C</addressOffset>
			<access>read-write</access>
			<resetValue>0x1F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAITRD</name>
					<description>Non-page mode read wait states or asynchronous page mode read first access wait state. Non-page mode read or asynchronous page mode read, first read only: 0x0 - 0x1E = (n + 1) CCLK cycles for read accesses. For non-sequential reads, the wait state time is (WAITRD + 1) x tCCLK. 0x1F = 32 CCLK cycles for read accesses (POR reset value).</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICWAITPAGE%s</name>
			
			<description>Delay for asynchronous page mode sequential accesses for EMC_CS0.</description>
			<addressOffset>0x210</addressOffset>
			<access>read-write</access>
			<resetValue>0x1F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAITPAGE</name>
					<description>Asynchronous page mode read after the first read wait states. Number of wait states for asynchronous page mode read accesses after the first read: 0x0 - 0x1E = (n+ 1) CCLK cycle read access time. For asynchronous page mode read for sequential reads, the wait state time for page mode accesses after the first read is (WAITPAGE + 1) x tCCLK. 0x1F = 32 CCLK cycle read access time (POR reset value).</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICWAITWR%s</name>
			
			<description>Delay from EMC_CS0 to a write access.</description>
			<addressOffset>0x214</addressOffset>
			<access>read-write</access>
			<resetValue>0x1F</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAITWR</name>
					<description>Write wait states. SRAM wait state time for write accesses after the first read: 0x0 - 0x1E = (n + 2) CCLK cycle write access time. The wait state time for write accesses after the first read is WAITWR (n + 2) x tCCLK. 0x1F = 33 CCLK cycle write access time (POR reset value).</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>4</dim>
			<dimIncrement>0x20</dimIncrement>
			<dimIndex>0-3</dimIndex>
			<name>STATICWAITTURN%s</name>
			
			<description>Number of bus turnaround cycles EMC_CS0.</description>
			<addressOffset>0x218</addressOffset>
			<access>read-write</access>
			<resetValue>0xF</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>WAITTURN</name>
					<description>Bus turn-around cycles. 0x0 - 0xE = (n + 1) CCLK turn-around cycles. Bus turn-around time is (WAITTURN + 1) x tCCLK. 0xF = 16 CCLK turn-around cycles (POR reset value).</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, user software should not write ones to reserved bits. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:4]</bitRange>
				</field>
			</fields>
		</register>
