cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
   <register>
      <name>P2_8</name>
      <description>I/O configuration register for pin P2[8]</description>
      <addressOffset>0x120</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[8]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_8</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>CAN_TD2</name>
                  <description>CAN2 transmitter output.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U2_TXD</name>
                  <description>Transmitter output for UART2.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U1_CTS</name>
                  <description>Clear to Send input for UART1.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENET_MDC</name>
                  <description>Ethernet MIIM clock.</description>
                  <value>0x4</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_2</name>
                  <description>LCD data.</description>
                  <value>0x6</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_6</name>
                  <description>LCD data.</description>
                  <value>0x7</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_9</name>
      <description>I/O configuration register for pin P2[9]</description>
      <addressOffset>0x124</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[9]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_9</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>USB_CONNECT1</name>
                  <description>USB1 SoftConnect control. Signal used to switch                                             an external 1.5 kW resistor                                             under the software control. Used with the SoftConnect                                             USB feature.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U2_RXD</name>
                  <description>Receiver input for UART2.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U4_RXD</name>
                  <description>Receiver input for USART4.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENET_MDIO</name>
                  <description>Ethernet MIIM data input and output.</description>
                  <value>0x4</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_3</name>
                  <description>LCD data.</description>
                  <value>0x6</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_7</name>
                  <description>LCD data.</description>
                  <value>0x7</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_10</name>
      <description>I/O configuration register for pin P2[10]</description>
      <addressOffset>0x128</addressOffset>
      <access>read-write</access>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[10]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_10</name>
                  <description>General purpose digital input/output pin. This
                                            pin includes a 5 ns input glitch filter.A LOW on this pin while RESET is LOW forces the
                                            on-chip boot loader to take over control of the part
                                            after a reset and go into ISP mode. </description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EINT0</name>
                  <description>External interrupt 0 input.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>NMI</name>
                  <description>Non-maskable interrupt input.</description>
                  <value>0x2</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_11</name>
      <description>I/O configuration register for pin P2[11]</description>
      <addressOffset>0x12C</addressOffset>
      <access>read-write</access>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[11]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_11</name>
                  <description>General purpose digital input/output pin. This
                                            pin includes a 5 ns input glitch filter.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EINT1</name>
                  <description>External interrupt 1 input.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SD_DAT_1</name>
                  <description>Data line 1 for SD card interface.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>I2S_TX_SCK</name>
                  <description>Transmit Clock. It is driven by the master and                                             received by the slave. Corresponds to the signal SCK in                                             the                                                 I2S-bus                                                 specification.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_CLKIN</name>
                  <description>LCD clock.</description>
                  <value>0x7</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_12</name>
      <description>I/O configuration register for pin P2[12]</description>
      <addressOffset>0x130</addressOffset>
      <access>read-write</access>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[12]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_12</name>
                  <description>General purpose digital input/output pin. This
                                            pin includes a 5 ns input glitch filter.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EINT2</name>
                  <description>External interrupt 2 input.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SD_DAT_2</name>
                  <description>Data line 2 for SD card interface.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>I2S_TX_WS</name>
                  <description>Transmit Word Select. It is driven by the master                                             and received by the slave. Corresponds to the signal WS                                             in the                                                 I2S-bus                                                 specification.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_4</name>
                  <description>LCD data.</description>
                  <value>0x4</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_3</name>
                  <description>LCD data.</description>
                  <value>0x5</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_8</name>
                  <description>LCD data.</description>
                  <value>0x6</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_18</name>
                  <description>LCD data.</description>
                  <value>0x7</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
      </fields>
   </register>
   <register>
      <name>P2_13</name>
      <description>I/O configuration register for pin P2[13]</description>
      <addressOffset>0x134</addressOffset>
      <access>read-write</access>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P2[13]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P2_13</name>
                  <description>General purpose digital input/output pin. This
                                            pin includes a 5 ns input glitch filter.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EINT3</name>
                  <description>External interrupt 3 input.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>SD_DAT_3</name>
                  <description>Data line 3 for SD card interface.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>I2S_TX_SDA</name>
                  <description>Transmit data. It is driven by the transmitter                                             and read by the receiver. Corresponds to the signal SD                                             in the                                                 I2S-bus                                                 specification.</description>
                  <value>0x3</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_5</name>
                  <description>LCD data.</description>
                  <value>0x5</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_9</name>
                  <description>LCD data.</description>
                  <value>0x6</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>LCD_VD_19</name>
                  <description>LCD data.</description>
                  <value>0x7</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
      </fields>
   </register>
