cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
   <register>
      <name>P3_22</name>
      <description>I/O configuration register for pin P3[22]</description>
      <addressOffset>0x1D8</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P3[22]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P3_22</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EMC_D_22</name>
                  <description>External memory data line 22.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PWM0_CAP0</name>
                  <description>Capture input for PWM0, channel 0.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>U1_RI</name>
                  <description>Ring Indicator input for UART1.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P3_23</name>
      <description>I/O configuration register for pin P3[23]</description>
      <addressOffset>0x1DC</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P3[23]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P3_23</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EMC_D_23</name>
                  <description>External memory data line 23.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PWM1_CAP0</name>
                  <description>Capture input for PWM1, channel 0.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>T0_CAP0</name>
                  <description>Capture input for Timer 0, channel 0.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
   <register>
      <name>P3_24</name>
      <description>I/O configuration register for pin P3[24]</description>
      <addressOffset>0x1E0</addressOffset>
      <access>read-write</access>
      <resetValue>0x00000030</resetValue>
      <resetMask>0xFFFFFFFF</resetMask>
      <fields>
         <field>
            <name>FUNC</name>
            <description>Selects pin function for pin P3[24]</description>
            <bitRange>[2:0]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>P3_24</name>
                  <description>General purpose digital input/output
                                            pin.</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>EMC_D_24</name>
                  <description>External memory data line 24.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PWM1_1</name>
                  <description>Pulse Width Modulator 1, output 1.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>T0_CAP1</name>
                  <description>Capture input for Timer 0, channel 1.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>MODE</name>
            <description>Selects function mode (on-chip pull-up/pull-down resistor
                        control).</description>
            <bitRange>[4:3]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INACTIVE_NO_PULL_DO</name>
                  <description>Inactive (no pull-down/pull-up resistor
                                enabled).</description>
                  <value>0x0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_DOWN_RESISTOR_E</name>
                  <description>Pull-down resistor enabled.</description>
                  <value>0x1</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>PULL_UP_RESISTOR_ENA</name>
                  <description>Pull-up resistor enabled.</description>
                  <value>0x2</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>REPEATER_MODE_</name>
                  <description>Repeater mode.</description>
                  <value>0x3</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>HYS</name>
            <description>Hysteresis.</description>
            <bitRange>[5:5]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>ENABLE_</name>
                  <description>Enable.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>INV</name>
            <description>Invert input</description>
            <bitRange>[6:6]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>INPUT_NOT_INVERTED_</name>
                  <description>Input not inverted (HIGH on pin reads as 1, LOW on pin
                                reads as 0).</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>INPUT_INVERTED_HIGH</name>
                  <description>Input inverted (HIGH on pin reads as 0, LOW on pin reads as
                                1).</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[8:7]</bitRange>
         </field>
         <field>
            <name>SLEW</name>
            <description>Driver slew rate</description>
            <bitRange>[9:9]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>STANDARD</name>
                  <description>Standard mode, output slew rate control is enabled. More
                                outputs can be switched simultaneously.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>FAST</name>
                  <description>Fast mode, slew rate control is disabled. Refer to the
                                appropriate specific device data sheet for details.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>OD</name>
            <description>Open-drain mode.</description>
            <bitRange>[10:10]</bitRange>
            <enumeratedValues>
               <name>ENUM</name>
               <enumeratedValue>
                  <name>DISABLE_</name>
                  <description>Disable.</description>
                  <value>0</value>
               </enumeratedValue>
               <enumeratedValue>
                  <name>OPEN_DRAIN_MODE_ENAB</name>
                  <description>Open-drain mode enabled. This is not a true open-drain
                                mode. Input cannot be pulled up above VDD.</description>
                  <value>1</value>
               </enumeratedValue>
            </enumeratedValues>
         </field>
         <field>
            <name>RESERVED</name>
            <description>Reserved.</description>
            <bitRange>[31:11]</bitRange>
         </field>
      </fields>
   </register>
