cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
			</registers>
		</peripheral>
		<peripheral>
	<name>ADC</name>
	<description>Analog-to-Digital Converter (ADC) </description>
	<groupName>ADC</groupName>
	<baseAddress>0x40034000</baseAddress>
	<addressBlock>
	<offset>0x0</offset>
	<size>0xFFF</size>
	<usage>registers</usage>
	</addressBlock>
	<interrupt>
	<name>ADC</name>
	<value>22</value>
	</interrupt>
	<registers>
		<register>
			<name>CR</name>
			<description>A/D Control Register. The ADCR register must be written to select the operating mode before A/D conversion can occur.</description>
			<addressOffset>0x000</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SEL</name>
					<description>Selects which of the AD0[7:0] pins is (are) to be sampled and converted. For AD0, bit 0 selects Pin AD0[0], and bit 7 selects pin AD0[7]. In software-controlled mode, only one of these bits should be 1. In hardware scan mode, any value containing 1 to 8 ones is allowed. All zeroes is equivalent to 0x01.</description>
					<bitRange>[7:0]</bitRange>

				</field>
				<field>
					<name>CLKDIV</name>
					<description>The APB clock (PCLK) is divided by (this value plus one) to produce the clock for the A/D converter, which should be less than or equal to 12.4 MHz. Typically, software should program the smallest value in this field that yields a clock of 12.4 MHz or slightly less, but in certain cases (such as a high-impedance analog source) a slower clock may be desirable.</description>
					<bitRange>[15:8]</bitRange>

				</field>
				<field>
					<name>BURST</name>
					<description>Burst mode</description>
					<bitRange>[16:16]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>BURST</name>
							<description>The AD converter does repeated conversions at up to 400 kHz, scanning (if necessary) through the pins selected by bits set to ones in the SEL field. The first conversion after the start corresponds to the least-significant 1 in the SEL field, then higher numbered 1-bits (pins) if applicable. Repeated conversions can be terminated by clearing this bit, but the conversion that's in progress when this bit is cleared will be completed. START bits must be 000 when BURST = 1 or conversions will not start.</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>SW</name>
							<description>Conversions are software controlled and require 31 clocks.</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[20:17]</bitRange>

				</field>
				<field>
					<name>PDN</name>
					<description>Power down mode</description>
					<bitRange>[21:21]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>POWERED</name>
							<description>The A/D converter is operational.</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>POWERDOWN</name>
							<description>The A/D converter is in power-down mode.</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:22]</bitRange>

				</field>
				<field>
					<name>START</name>
					<description>When the BURST bit is 0, these bits control whether and when an A/D conversion is started:</description>
					<bitRange>[26:24]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>NO_START_THIS_VALUE</name>
							<description>No start (this value should be used when clearing PDN to 0).</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>START_CONVERSION_NOW</name>
							<description>Start conversion now.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P2_10</name>
							<description>Start conversion when the edge selected by bit 27 occurs on the P2[10] pin.</description>
							<value>0x2</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>P1_27</name>
							<description>Start conversion when the edge selected by bit 27 occurs on the P1[27] pin.</description>
							<value>0x3</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAT0_1</name>
							<description>Start conversion when the edge selected by bit 27 occurs on MAT0.1. Note that this does not require that the MAT0.1 function appear on a device pin.</description>
							<value>0x4</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAT0_3</name>
							<description>Start conversion when the edge selected by bit 27 occurs on MAT0.3. Note that it is not possible to cause the MAT0.3 function to appear on a device pin.</description>
							<value>0x5</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAT1_0</name>
							<description>Start conversion when the edge selected by bit 27 occurs on MAT1.0. Note that this does not require that the MAT1.0 function appear on a device pin.</description>
							<value>0x6</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>MAT1_1</name>
							<description>Start conversion when the edge selected by bit 27 occurs on MAT1.1. Note that this does not require that the MAT1.1 function appear on a device pin.</description>
							<value>0x7</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>EDGE</name>
					<description>This bit is significant only when the START field contains 010-111. In these cases:</description>
					<bitRange>[27:27]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>FALLLING</name>
							<description>Start conversion on a falling edge on the selected CAP/MAT signal.</description>
							<value>1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>RISING</name>
							<description>Start conversion on a rising edge on the selected CAP/MAT signal.</description>
							<value>0</value>
						</enumeratedValue>
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:28]</bitRange>

