cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved, the value read from a reserved bit is not defined.</description>
					<bitRange>[31:24]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>RFS</name>
			<description>Receive frame status. Can only be written when RM in CANMOD is 1.</description>
			<addressOffset>0x020</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IDINDEX</name>
					<description>ID Index. If the BP bit (below) is 0, this value is the zero-based number of the Lookup Table RAM entry at which the Acceptance Filter matched the received Identifier. Disabled entries in the Standard tables are included in this numbering, but will not be matched. See Section 21.17 Examples of acceptance filter tables and ID index values on page 587 for examples of ID Index values.</description>
					<bitRange>[9:0]</bitRange>
				</field>
				<field>
					<name>BP</name>
					<description>If this bit is 1, the current message was received in AF Bypass mode, and the ID Index field (above) is meaningless.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[15:11]</bitRange>
				</field>
				<field>
					<name>DLC</name>
					<description>The field contains the Data Length Code (DLC) field of the current received message. When RTR = 0, this is related to the number of data bytes available in the CANRDA and CANRDB registers as follows: 0000-0111 = 0 to 7 bytes1000-1111 = 8 bytes With RTR = 1, this value indicates the number of data bytes requested to be sent back, with the same encoding.</description>
					<bitRange>[19:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[29:20]</bitRange>
				</field>
				<field>
					<name>RTR</name>
					<description>This bit contains the Remote Transmission Request bit of the current received message. 0 indicates a Data Frame, in which (if DLC is non-zero) data can be read from the CANRDA and possibly the CANRDB registers. 1 indicates a Remote frame, in which case the DLC value identifies the number of data bytes requested to be sent using the same Identifier.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>FF</name>
					<description>A 0 in this bit indicates that the current received message included an 11-bit Identifier, while a 1 indicates a 29-bit Identifier. This affects the contents of the CANid register described below.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RID</name>
			<description>Received Identifier. Can only be written when RM in CANMOD is 1.</description>
			<addressOffset>0x024</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ID</name>
					<description>The 11-bit Identifier field of the current received message. In CAN 2.0A, these bits are called ID10-0, while in CAN 2.0B they're called ID29-18.</description>
					<bitRange>[10:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. The value read from a reserved bit is not defined.</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RDA</name>
			<description>Received data bytes 1-4. Can only be written when RM in CANMOD is 1.</description>
			<addressOffset>0x028</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA1</name>
					<description>Data 1. If the DLC field in CANRFS >= 0001, this contains the first Data byte of the current received message.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA2</name>
					<description>Data 2. If the DLC field in CANRFS >= 0010, this contains the first Data byte of the current received message.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>DATA3</name>
					<description>Data 3. If the DLC field in CANRFS >= 0011, this contains the first Data byte of the current received message.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>DATA4</name>
					<description>Data 4. If the DLC field in CANRFS >= 0100, this contains the first Data byte of the current received message.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RDB</name>
			<description>Received data bytes 5-8. Can only be written when RM in CANMOD is 1.</description>
			<addressOffset>0x02C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DATA5</name>
					<description>Data 5. If the DLC field in CANRFS >= 0101, this contains the first Data byte of the current received message.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA6</name>
					<description>Data 6. If the DLC field in CANRFS >= 0110, this contains the first Data byte of the current received message.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>DATA7</name>
					<description>Data 7. If the DLC field in CANRFS >= 0111, this contains the first Data byte of the current received message.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>DATA8</name>
					<description>Data 8. If the DLC field in CANRFS >= 1000, this contains the first Data byte of the current received message.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>1-3</dimIndex>
			<name>TFI%s</name>
			<description>Transmit
frame info (Tx Buffer )</description>
			<addressOffset>0x030</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PRIO</name>
					<description>If the TPM (Transmit Priority Mode) bit in the CANxMOD register is set to 1, enabled Tx Buffers contend for the right to send their messages based on this field. The buffer with the lowest TX Priority value wins the prioritization and is sent first.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>DLC</name>
					<description>Data Length Code. This value is sent in the DLC field of the next transmit message. In addition, if RTR = 0, this value controls the number of Data bytes sent in the next transmit message, from the CANxTDA and CANxTDB registers: 0000-0111 = 0-7 bytes 1xxx = 8 bytes</description>
					<bitRange>[19:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[29:20]</bitRange>
				</field>
				<field>
					<name>RTR</name>
					<description>This value is sent in the RTR bit of the next transmit message. If this bit is 0, the number of data bytes called out by the DLC field are sent from the CANxTDA and CANxTDB registers. If this bit is 1, a Remote Frame is sent, containing a request for that number of bytes.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>FF</name>
					<description>If this bit is 0, the next transmit message will be sent with an 11-bit Identifier (standard frame format), while if it's 1, the message will be sent with a 29-bit Identifier (extended frame format).</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>1-3</dimIndex>
			<name>TID%s</name>
			<description>Transmit
Identifier (Tx Buffer)</description>
			<addressOffset>0x034</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>ID</name>
					<description>The 11-bit Identifier to be sent in the next transmit message.</description>
					<bitRange>[10:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:11]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>1-3</dimIndex>
			<name>TDA%s</name>
			<description>Transmit
data bytes 1-4 (Tx Buffer)</description>
			<addressOffset>0x038</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DATA1</name>
					<description>Data 1. If RTR = 0 and DLC >= 0001 in the corresponding CANxTFI, this byte is sent as the first Data byte of the next transmit message.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA2</name>
					<description>Data 2. If RTR = 0 and DLC >= 0010 in the corresponding CANxTFI, this byte is sent as the 2nd Data byte of the next transmit message.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>DATA3</name>
					<description>Data 3. If RTR = 0 and DLC >= 0011 in the corresponding CANxTFI, this byte is sent as the 3rd Data byte of the next transmit message.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>DATA4</name>
					<description>Data 4. If RTR = 0 and DLC >= 0100 in the corresponding CANxTFI, this byte is sent as the 4th Data byte of the next transmit message.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<dim>3</dim>
			<dimIncrement>0x10</dimIncrement>
			<dimIndex>1-3</dimIndex>
			<name>TDB%s</name>
			<description>Transmit
data bytes 5-8 (Tx Buffer )</description>
			<addressOffset>0x03C</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>DATA5</name>
					<description>Data 5. If RTR = 0 and DLC >= 0101 in the corresponding CANTFI, this byte is sent as the 5th Data byte of the next transmit message.</description>
					<bitRange>[7:0]</bitRange>
				</field>
				<field>
					<name>DATA6</name>
					<description>Data 6. If RTR = 0 and DLC >= 0110 in the corresponding CANTFI, this byte is sent as the 6th Data byte of the next transmit message.</description>
					<bitRange>[15:8]</bitRange>
				</field>
				<field>
					<name>DATA7</name>
					<description>Data 7. If RTR = 0 and DLC >= 0111 in the corresponding CANTFI, this byte is sent as the 7th Data byte of the next transmit message.</description>
					<bitRange>[23:16]</bitRange>
				</field>
				<field>
					<name>DATA8</name>
					<description>Data 8. If RTR = 0 and DLC >= 1000 in the corresponding CANTFI, this byte is sent as the 8th Data byte of the next transmit message.</description>
					<bitRange>[31:24]</bitRange>
				</field>
			</fields>
		</register>
