cmsis-svd/cmsis-svd/data/NXP/LPC178x_7x.xml
				</field>
			</fields>
		</register>
		<register>
			<name>PCLKSEL</name>
			<description>Peripheral Clock Selection register</description>
			<addressOffset>0x1A8</addressOffset>
			<access>read-write</access>
			<resetValue>0x10</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>PCLKDIV</name>
					<description>Selects the divide value for the clock used for all APB peripherals. 0 = The divider is turned off., no clock will be provided to APB peripherals.. 1 = The input clock is divided by 1 to produce the APB peripheral clock. 2 = The input clock is divided by 2 to produce the APB peripheral clock. 3 = The input clock is divided by 3 to produce the APB peripheral clock. ... 31 = The input clock is divided by 31 to produce the APB peripheral clock.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PBOOST</name>
			<description>Power boost register</description>
			<addressOffset>0x1B0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>Boost</name>
					<description>Boost control bits. 00 : Boost is off, operation must be below 100 MHz. 11 : Boost is on, operation up to 120 MHz is supported. Other values are not allowed.</description>
					<bitRange>[1:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:2]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>SPIFICLKSEL</name>
			<description>SPIFI Clock Selection register</description>
			<addressOffset>0x1B4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>SPIFIDIV</name>
					<description>Selects the divide value for creating the SPIFI clock from the selected clock source. 0 = The divider is turned off., no clock will be provided to the SPIFI. 1 = The input clock is divided by 1 to produce the SPIFI clock. 2 = The input clock is divided by 2 to produce the SPIFI clock. 3 = The input clock is divided by 3 to produce the SPIFI clock. ... 31 = The input clock is divided by 31 to produce the SPIFI clock.</description>
					<bitRange>[4:0]</bitRange>

				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:5]</bitRange>

				</field>
				<field>
					<name>SPIFISEL</name>
					<description>Selects the input clock for the USB clock divider.</description>
					<bitRange>[9:8]</bitRange>
					<enumeratedValues>
					<name>ENUM</name>
						<enumeratedValue>
							<name>SYSCLK_IS_USED_AS_TH</name>
							<description>Sysclk is used as the input to the SPIFI clock divider.</description>
							<value>0x0</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_OUTPUT_OF_THE_MA</name>
							<description>The output of the Main PLL is used as the input to the SPIFI clock divider.</description>
							<value>0x1</value>
						</enumeratedValue>
						<enumeratedValue>
							<name>THE_OUTPUT_OF_THE_AL</name>
							<description>The output of the Alt PLL is used as the input to the SPIFI clock divider.</description>
							<value>0x2</value>
						</enumeratedValue>
					
					</enumeratedValues>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:10]</bitRange>

				</field>
			</fields>
		</register>
		<register>
			<name>LCD_CFG</name>
			<description>LCD Clock configuration register</description>
			<addressOffset>0x1B8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKDIV</name>
					<description>LCD panel clock prescaler selection. The value in the this register plus 1 is used to divide the selected input clock (see the CLKSEL bit in the LCD_POL register), to produce the panel clock.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:5]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>USBINTST</name>
			<description>USB Interrupt Status</description>
			<addressOffset>0x1C0</addressOffset>
			<access>read-write</access>
			<resetValue>0x80000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>USB_INT_REQ_LP</name>
					<description>Low priority interrupt line status. This bit is read-only.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>USB_INT_REQ_HP</name>
					<description>High priority interrupt line status. This bit is read-only.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>USB_INT_REQ_DMA</name>
					<description>DMA interrupt line status. This bit is read-only.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>USB_HOST_INT</name>
					<description>USB host interrupt line status. This bit is read-only.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>USB_ATX_INT</name>
					<description>External ATX interrupt line status. This bit is read-only.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>USB_OTG_INT</name>
					<description>OTG interrupt line status. This bit is read-only.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>USB_I2C_INT</name>
					<description>I2C module interrupt line status. This bit is read-only.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>USB_NEED_CLK</name>
					<description>USB need clock indicator. This bit is read-only. This bit is set to 1 when USB activity or a change of state on the USB data pins is detected, and it indicates that a PLL supplied clock of 48 MHz is needed. Once USB_NEED_CLK becomes one, it resets to zero 5 ms after the last packet has been received/sent, or 2 ms after the Suspend Change (SUS_CH) interrupt has occurred. A change of this bit from 0 to 1 can wake up the microcontroller if activity on the USB bus is selected to wake up the part from the Power-down mode (see Section 4.7.9 Wake-up from Reduced Power Modes for details). Also see Section 4.5.8 PLLs and Power-down mode and Section 4.7.10 Power Control for Peripherals register (PCONP - 0x400F C0C4) for considerations about the PLL and invoking the Power-down mode. This bit is read-only.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[30:9]</bitRange>
				</field>
				<field>
					<name>EN_USB_INTS</name>
					<description>Enable all USB interrupts. When this bit is cleared, the NVIC does not see the ORed output of the USB interrupt lines.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>DMACREQSEL</name>
			<description>Selects between alternative requests on DMA channels 0 through 7 and 10 through 15</description>
			<addressOffset>0x1C4</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>DMASEL00</name>
					<description>Selects the DMA request for GPDMA input 0: 0 - (unused) 1 - Timer 0 match 0 is selected.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>DMASEL01</name>
					<description>Selects the DMA request for GPDMA input 1: 0 - SD card interface is selected. 1 - Timer 0 match 1 is selected.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>DMASEL02</name>
					<description>Selects the DMA request for GPDMA input 2: 0 - SSP0 transmit is selected. 1 - Timer 1 match 0 is selected.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>DMASEL03</name>
					<description>Selects the DMA request for GPDMA input 3: 0 - SSP0 receive is selected. 1 - Timer 1 match 1 is selected.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>DMASEL04</name>
					<description>Selects the DMA request for GPDMA input 4: 0 - SSP1 transmit is selected. 1 - Timer 2 match 0 is selected.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>DMASEL05</name>
					<description>Selects the DMA request for GPDMA input 5: 0 - SSP1 receive is selected. 1 - Timer 2 match 1 is selected.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>DMASEL06</name>
					<description>Selects the DMA request for GPDMA input 6: 0 - SSP2 transmit is selected. 1 - I2S channel 0 is selected.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>DMASEL07</name>
					<description>Selects the DMA request for GPDMA input 7: 0 - SSP2 receive is selected. 1 - I2S channel 1 is selected.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[9:8]</bitRange>
				</field>
				<field>
					<name>DMASEL10</name>
					<description>Selects the DMA request for GPDMA input 10: 0 - UART0 transmit is selected. 1 - UART3 transmit is selected.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>DMASEL11</name>
					<description>Selects the DMA request for GPDMA input 11: 0 - UART0 receive is selected. 1 - UART3 receive is selected.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>DMASEL12</name>
					<description>Selects the DMA request for GPDMA input 12: 0 - UART1 transmit is selected. 1 - UART4 transmit is selected.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>DMASEL13</name>
					<description>Selects the DMA request for GPDMA input 13: 0 - UART1 receive is selected. 1 - UART4 receive is selected.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>DMASEL14</name>
					<description>Selects the DMA request for GPDMA input 14: 0 - UART2 transmit is selected. 1 - Timer 3 match 0 is selected.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>DMASEL15</name>
					<description>Selects the DMA request for GPDMA input 15: 0 - UART2 receive is selected. 1 - Timer 3 match 1 is selected.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:16]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>CLKOUTCFG</name>
			<description>Clock Output Configuration register</description>
			<addressOffset>0x1C8</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CLKOUTSEL</name>
					<description>Selects the clock source for the CLKOUT function. 0x0 = Selects the CPU clock as the CLKOUT source. 0x1 = Selects the main oscillator as the CLKOUT source. 0x2 = Selects the Internal RC oscillator as the CLKOUT source. 0x3 = Selects the USB clock as the CLKOUT source. 0x4 = Selects the RTC oscillator as the CLKOUT source. 0x5 = Selects the SPIFI clock as the CLKOUT source. 0x6 = Selects the Watchdog oscillator as the CLKOUT source. Other settings are reserved. Do not use.</description>
					<bitRange>[3:0]</bitRange>
				</field>
				<field>
					<name>CLKOUTDIV</name>
					<description>Integer value to divide the output clock by, minus one. 0x0 = Clock is divided by 1. 0x1 = Clock is divided by 2. 0x2 = Clock is divided by 3. ... 0xF = Clock is divided by 16.</description>
					<bitRange>[7:4]</bitRange>
				</field>
				<field>
					<name>CLKOUT_EN</name>
					<description>CLKOUT enable control, allows switching the CLKOUT source without glitches. Clear to stop CLKOUT on the next falling edge. Set to enable CLKOUT.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>CLKOUT_ACT</name>
					<description>CLKOUT activity indication. Reads as 1 when CLKOUT is enabled. Read as 0 when CLKOUT has been disabled via the CLKOUT_EN bit and the clock has completed being stopped.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:10]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RSTCON0</name>
			<description>Individual peripheral reset control bits</description>
			<addressOffset>0x1CC</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RSTLCD</name>
					<description>LCD controller reset control bit.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RSTTIM0</name>
					<description>Timer/Counter 0 reset control bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RSTTIM1</name>
					<description>Timer/Counter 1 reset control bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RSTUART0</name>
					<description>UART0 reset control bit.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RSTUART1</name>
					<description>UART1 reset control bit.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RSTPWM0</name>
					<description>PWM0 reset control bit.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RSTPWM1</name>
					<description>PWM1 reset control bit.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RSTI2C0</name>
					<description>The I2C0 interface reset control bit.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RSTUART4</name>
					<description>UART4 reset control bit.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RSTRTC</name>
					<description>RTC and Event Monitor/Recorder reset control bit. RTC reset is limited, see Table 628 Real-Time Clock register map for details.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RSTSSP1</name>
					<description>The SSP 1 interface reset control bit.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RSTEMC</name>
					<description>External Memory Controller reset control bit.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RSTADC</name>
					<description>A/D converter (ADC) reset control bit.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RSTCAN1</name>
					<description>CAN Controller 1 reset control bit. Note: The CAN acceptance filter may be reset by a separate bit in the RSTCON1 register.</description>
					<bitRange>[13:13]</bitRange>
				</field>
				<field>
					<name>RSTCAN2</name>
					<description>CAN Controller 2 reset control bit. Note: The CAN acceptance filter may be reset by a separate bit in the RSTCON1 register.</description>
					<bitRange>[14:14]</bitRange>
				</field>
				<field>
					<name>RSTGPIO</name>
					<description>Reset control bit for GPIO, and GPIO interrupts. Note: IOCON may be reset by a separate bit in the RSTCON1 register.</description>
					<bitRange>[15:15]</bitRange>
				</field>
				<field>
					<name>RSTSPIFI</name>
					<description>SPI Flash Interface reset control bit (LPC1773 only).</description>
					<bitRange>[16:16]</bitRange>
				</field>
				<field>
					<name>RSTMCPWM</name>
					<description>Motor Control PWM reset control bit.</description>
					<bitRange>[17:17]</bitRange>
				</field>
				<field>
					<name>RSTQEI</name>
					<description>Quadrature Encoder Interface reset control bit.</description>
					<bitRange>[18:18]</bitRange>
				</field>
				<field>
					<name>RSTI2C1</name>
					<description>The I2C1 interface reset control bit.</description>
					<bitRange>[19:19]</bitRange>
				</field>
				<field>
					<name>RSTSSP2</name>
					<description>The SSP2 interface reset control bit.</description>
					<bitRange>[20:20]</bitRange>
				</field>
				<field>
					<name>RSTSSP0</name>
					<description>The SSP0 interface reset control bit.</description>
					<bitRange>[21:21]</bitRange>
				</field>
				<field>
					<name>RSTTIM2</name>
					<description>Timer 2 reset control bit.</description>
					<bitRange>[22:22]</bitRange>
				</field>
				<field>
					<name>RSTTIM3</name>
					<description>Timer 3 reset control bit.</description>
					<bitRange>[23:23]</bitRange>
				</field>
				<field>
					<name>RSTUART2</name>
					<description>UART 2 reset control bit.</description>
					<bitRange>[24:24]</bitRange>
				</field>
				<field>
					<name>RSTUART3</name>
					<description>UART 3 reset control bit.</description>
					<bitRange>[25:25]</bitRange>
				</field>
				<field>
					<name>RSTI2C2</name>
					<description>I2C interface 2 reset control bit.</description>
					<bitRange>[26:26]</bitRange>
				</field>
				<field>
					<name>RSTI2S</name>
					<description>I2S interface reset control bit.</description>
					<bitRange>[27:27]</bitRange>
				</field>
				<field>
					<name>RSTSDC</name>
					<description>SD Card interface reset control bit.</description>
					<bitRange>[28:28]</bitRange>
				</field>
				<field>
					<name>RSTGPDMA</name>
					<description>GPDMA function reset control bit.</description>
					<bitRange>[29:29]</bitRange>
				</field>
				<field>
					<name>RSTENET</name>
					<description>Ethernet block reset control bit.</description>
					<bitRange>[30:30]</bitRange>
				</field>
				<field>
					<name>RSTUSB</name>
					<description>USB interface reset control bit.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>RSTCON1</name>
			<description>Individual peripheral reset control bits</description>
			<addressOffset>0x1D0</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>RSTIOCON</name>
					<description>Reset control bit for the IOCON registers.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RSTDAC</name>
					<description>D/A converter (DAC) reset control bit.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RSTCANACC</name>
					<description>CAN acceptance filter reset control bit.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:3]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>EMCDLYCTL</name>
			<description>Values for the 4 programmable delays associated with SDRAM operation.</description>
			<addressOffset>0x1DC</addressOffset>
			<access>read-write</access>
			<resetValue>0x210</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CMDDLY</name>
					<description>Programmable delay value for EMC outputs in command delayed mode. See Section 10.12.6. The delay amount is roughly (CMDDLY+1) * 250 picoseconds. This field applies only when the command delayed read strategy is selected in the EMCDynamicReadConfig register. In this mode, all control outputs from the EMC are delayed, but the output clock is not. Delaying the control outputs changes dynamic characteristics defined in the device data sheet.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[7:5]</bitRange>
				</field>
				<field>
					<name>FBCLKDLY</name>
					<description>Programmable delay value for the feedback clock that controls input data sampling. See  Section 10.5.3. The delay amount is roughly (FBCLKDLY+1) * 250 picoseconds.</description>
					<bitRange>[12:8]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[15:13]</bitRange>
				</field>
				<field>
					<name>CLKOUT0DLY</name>
					<description>Programmable delay value for the CLKOUT0 output. This would typically be used in clock delayed mode. See Section 10.12.6 The delay amount is roughly (CLKOUT0DLY+1) * 250 picoseconds. Delaying the clock output changes dynamic characteristics defined in the device data sheet.</description>
					<bitRange>[20:16]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[23:21]</bitRange>
				</field>
				<field>
					<name>CLKOUT1DLY</name>
					<description>Programmable delay value for the CLKOUT1 output. This would typically be used in clock delayed mode. See Section 10.12.6 The delay amount is roughly (CLKOUT1DLY+1) * 250 picoseconds.</description>
					<bitRange>[28:24]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Read value is undefined, only zero should be written.</description>
					<bitRange>[31:29]</bitRange>
				</field>
			</fields>
		</register>
